; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=84, out_folder=htg/blocksworld//training, instance_id=64, seed=2088

(define (problem blocksworld-64)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 - object)
 (:init 
    (arm-empty)
    (clear b51)
    (on b51 b68)
    (on b68 b16)
    (on-table b16)
    (clear b42)
    (on b42 b60)
    (on-table b60)
    (clear b32)
    (on b32 b19)
    (on b19 b79)
    (on b79 b47)
    (on b47 b11)
    (on b11 b18)
    (on-table b18)
    (clear b29)
    (on b29 b22)
    (on b22 b23)
    (on b23 b1)
    (on b1 b83)
    (on b83 b20)
    (on b20 b5)
    (on b5 b44)
    (on-table b44)
    (clear b46)
    (on b46 b2)
    (on b2 b76)
    (on b76 b62)
    (on-table b62)
    (clear b36)
    (on b36 b55)
    (on b55 b56)
    (on b56 b31)
    (on b31 b37)
    (on b37 b53)
    (on b53 b82)
    (on b82 b78)
    (on b78 b9)
    (on b9 b21)
    (on b21 b59)
    (on b59 b12)
    (on b12 b65)
    (on b65 b6)
    (on-table b6)
    (clear b8)
    (on-table b8)
    (clear b39)
    (on b39 b10)
    (on b10 b7)
    (on b7 b72)
    (on b72 b84)
    (on b84 b48)
    (on b48 b34)
    (on b34 b30)
    (on b30 b40)
    (on b40 b43)
    (on b43 b70)
    (on b70 b57)
    (on b57 b24)
    (on b24 b80)
    (on b80 b41)
    (on b41 b61)
    (on b61 b66)
    (on b66 b58)
    (on b58 b25)
    (on b25 b35)
    (on b35 b77)
    (on b77 b33)
    (on b33 b67)
    (on b67 b45)
    (on b45 b81)
    (on b81 b13)
    (on b13 b75)
    (on b75 b54)
    (on b54 b64)
    (on b64 b38)
    (on b38 b52)
    (on b52 b15)
    (on b15 b17)
    (on b17 b4)
    (on b4 b71)
    (on b71 b3)
    (on b3 b27)
    (on b27 b69)
    (on b69 b50)
    (on b50 b14)
    (on b14 b74)
    (on b74 b26)
    (on b26 b49)
    (on b49 b28)
    (on b28 b63)
    (on b63 b73)
    (on-table b73))
 (:goal  (and 
    (clear b2)
    (on b2 b1)
    (on b1 b7)
    (on b7 b8)
    (on b8 b5)
    (on b5 b3)
    (on b3 b4)
    (on b4 b6)
    (on-table b6))))

; plan
1. (unstack b46 b2)
   deleted: (on b46 b2) (clear b46) (arm-empty)
   added: (holding b46) (clear b2)
   goals met: 2 of 9
2. (putdown b46)
   deleted: (holding b46)
   added: (clear b46) (arm-empty) (on-table b46)
   goals met: 2 of 9
3. (unstack b39 b10)
   deleted: (on b39 b10) (clear b39) (arm-empty)
   added: (holding b39) (clear b10)
   goals met: 2 of 9
4. (putdown b39)
   deleted: (holding b39)
   added: (clear b39) (arm-empty) (on-table b39)
   goals met: 2 of 9
5. (unstack b10 b7)
   deleted: (on b10 b7) (clear b10) (arm-empty)
   added: (holding b10) (clear b7)
   goals met: 2 of 9
6. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 2 of 9
7. (unstack b7 b72)
   deleted: (on b7 b72) (clear b7) (arm-empty)
   added: (holding b7) (clear b72)
   goals met: 2 of 9
8. (stack b7 b8)
   deleted: (clear b8) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b8)
   goals met: 3 of 9
9. (unstack b29 b22)
   deleted: (on b29 b22) (clear b29) (arm-empty)
   added: (holding b29) (clear b22)
   goals met: 3 of 9
10. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 3 of 9
11. (unstack b22 b23)
   deleted: (on b22 b23) (clear b22) (arm-empty)
   added: (holding b22) (clear b23)
   goals met: 3 of 9
12. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 3 of 9
13. (unstack b23 b1)
   deleted: (on b23 b1) (clear b23) (arm-empty)
   added: (holding b23) (clear b1)
   goals met: 3 of 9
14. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 3 of 9
15. (unstack b1 b83)
   deleted: (on b1 b83) (clear b1) (arm-empty)
   added: (holding b1) (clear b83)
   goals met: 3 of 9
16. (stack b1 b7)
   deleted: (clear b7) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b7)
   goals met: 4 of 9
17. (unstack b2 b76)
   deleted: (on b2 b76) (clear b2) (arm-empty)
   added: (holding b2) (clear b76)
   goals met: 3 of 9
18. (stack b2 b1)
   deleted: (clear b1) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b1)
   goals met: 5 of 9
19. (unstack b83 b20)
   deleted: (on b83 b20) (clear b83) (arm-empty)
   added: (holding b83) (clear b20)
   goals met: 5 of 9
20. (putdown b83)
   deleted: (holding b83)
   added: (clear b83) (arm-empty) (on-table b83)
   goals met: 5 of 9
21. (unstack b72 b84)
   deleted: (on b72 b84) (clear b72) (arm-empty)
   added: (holding b72) (clear b84)
   goals met: 5 of 9
22. (putdown b72)
   deleted: (holding b72)
   added: (clear b72) (arm-empty) (on-table b72)
   goals met: 5 of 9
23. (unstack b84 b48)
   deleted: (on b84 b48) (clear b84) (arm-empty)
   added: (holding b84) (clear b48)
   goals met: 5 of 9
24. (putdown b84)
   deleted: (holding b84)
   added: (clear b84) (arm-empty) (on-table b84)
   goals met: 5 of 9
25. (unstack b48 b34)
   deleted: (on b48 b34) (clear b48) (arm-empty)
   added: (holding b48) (clear b34)
   goals met: 5 of 9
26. (putdown b48)
   deleted: (holding b48)
   added: (clear b48) (arm-empty) (on-table b48)
   goals met: 5 of 9
27. (unstack b34 b30)
   deleted: (on b34 b30) (clear b34) (arm-empty)
   added: (holding b34) (clear b30)
   goals met: 5 of 9
28. (putdown b34)
   deleted: (holding b34)
   added: (clear b34) (arm-empty) (on-table b34)
   goals met: 5 of 9
29. (unstack b30 b40)
   deleted: (on b30 b40) (clear b30) (arm-empty)
   added: (holding b30) (clear b40)
   goals met: 5 of 9
30. (putdown b30)
   deleted: (holding b30)
   added: (clear b30) (arm-empty) (on-table b30)
   goals met: 5 of 9
31. (unstack b40 b43)
   deleted: (on b40 b43) (clear b40) (arm-empty)
   added: (holding b40) (clear b43)
   goals met: 5 of 9
32. (putdown b40)
   deleted: (holding b40)
   added: (clear b40) (arm-empty) (on-table b40)
   goals met: 5 of 9
33. (unstack b43 b70)
   deleted: (on b43 b70) (clear b43) (arm-empty)
   added: (holding b43) (clear b70)
   goals met: 5 of 9
34. (putdown b43)
   deleted: (holding b43)
   added: (clear b43) (arm-empty) (on-table b43)
   goals met: 5 of 9
35. (unstack b20 b5)
   deleted: (on b20 b5) (clear b20) (arm-empty)
   added: (holding b20) (clear b5)
   goals met: 5 of 9
36. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 5 of 9
37. (unstack b36 b55)
   deleted: (on b36 b55) (clear b36) (arm-empty)
   added: (holding b36) (clear b55)
   goals met: 5 of 9
38. (putdown b36)
   deleted: (holding b36)
   added: (clear b36) (arm-empty) (on-table b36)
   goals met: 5 of 9
39. (unstack b55 b56)
   deleted: (on b55 b56) (clear b55) (arm-empty)
   added: (holding b55) (clear b56)
   goals met: 5 of 9
40. (putdown b55)
   deleted: (holding b55)
   added: (clear b55) (arm-empty) (on-table b55)
   goals met: 5 of 9
41. (unstack b70 b57)
   deleted: (on b70 b57) (clear b70) (arm-empty)
   added: (holding b70) (clear b57)
   goals met: 5 of 9
42. (putdown b70)
   deleted: (holding b70)
   added: (clear b70) (arm-empty) (on-table b70)
   goals met: 5 of 9
43. (unstack b57 b24)
   deleted: (on b57 b24) (clear b57) (arm-empty)
   added: (holding b57) (clear b24)
   goals met: 5 of 9
44. (putdown b57)
   deleted: (holding b57)
   added: (clear b57) (arm-empty) (on-table b57)
   goals met: 5 of 9
45. (unstack b24 b80)
   deleted: (on b24 b80) (clear b24) (arm-empty)
   added: (holding b24) (clear b80)
   goals met: 5 of 9
46. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 5 of 9
47. (unstack b80 b41)
   deleted: (on b80 b41) (clear b80) (arm-empty)
   added: (holding b80) (clear b41)
   goals met: 5 of 9
48. (putdown b80)
   deleted: (holding b80)
   added: (clear b80) (arm-empty) (on-table b80)
   goals met: 5 of 9
49. (unstack b41 b61)
   deleted: (on b41 b61) (clear b41) (arm-empty)
   added: (holding b41) (clear b61)
   goals met: 5 of 9
50. (putdown b41)
   deleted: (holding b41)
   added: (clear b41) (arm-empty) (on-table b41)
   goals met: 5 of 9
51. (unstack b61 b66)
   deleted: (on b61 b66) (clear b61) (arm-empty)
   added: (holding b61) (clear b66)
   goals met: 5 of 9
52. (putdown b61)
   deleted: (holding b61)
   added: (clear b61) (arm-empty) (on-table b61)
   goals met: 5 of 9
53. (unstack b66 b58)
   deleted: (on b66 b58) (clear b66) (arm-empty)
   added: (holding b66) (clear b58)
   goals met: 5 of 9
54. (putdown b66)
   deleted: (holding b66)
   added: (clear b66) (arm-empty) (on-table b66)
   goals met: 5 of 9
55. (unstack b58 b25)
   deleted: (on b58 b25) (clear b58) (arm-empty)
   added: (holding b58) (clear b25)
   goals met: 5 of 9
56. (putdown b58)
   deleted: (holding b58)
   added: (clear b58) (arm-empty) (on-table b58)
   goals met: 5 of 9
57. (unstack b25 b35)
   deleted: (on b25 b35) (clear b25) (arm-empty)
   added: (holding b25) (clear b35)
   goals met: 5 of 9
58. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 5 of 9
59. (unstack b35 b77)
   deleted: (on b35 b77) (clear b35) (arm-empty)
   added: (holding b35) (clear b77)
   goals met: 5 of 9
60. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 5 of 9
61. (unstack b77 b33)
   deleted: (on b77 b33) (clear b77) (arm-empty)
   added: (holding b77) (clear b33)
   goals met: 5 of 9
62. (putdown b77)
   deleted: (holding b77)
   added: (clear b77) (arm-empty) (on-table b77)
   goals met: 5 of 9
63. (unstack b33 b67)
   deleted: (on b33 b67) (clear b33) (arm-empty)
   added: (holding b33) (clear b67)
   goals met: 5 of 9
64. (putdown b33)
   deleted: (holding b33)
   added: (clear b33) (arm-empty) (on-table b33)
   goals met: 5 of 9
65. (unstack b67 b45)
   deleted: (on b67 b45) (clear b67) (arm-empty)
   added: (holding b67) (clear b45)
   goals met: 5 of 9
66. (putdown b67)
   deleted: (holding b67)
   added: (clear b67) (arm-empty) (on-table b67)
   goals met: 5 of 9
67. (unstack b45 b81)
   deleted: (on b45 b81) (clear b45) (arm-empty)
   added: (holding b45) (clear b81)
   goals met: 5 of 9
68. (putdown b45)
   deleted: (holding b45)
   added: (clear b45) (arm-empty) (on-table b45)
   goals met: 5 of 9
69. (unstack b81 b13)
   deleted: (on b81 b13) (clear b81) (arm-empty)
   added: (holding b81) (clear b13)
   goals met: 5 of 9
70. (putdown b81)
   deleted: (holding b81)
   added: (clear b81) (arm-empty) (on-table b81)
   goals met: 5 of 9
71. (unstack b13 b75)
   deleted: (on b13 b75) (clear b13) (arm-empty)
   added: (holding b13) (clear b75)
   goals met: 5 of 9
72. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 5 of 9
73. (unstack b75 b54)
   deleted: (on b75 b54) (clear b75) (arm-empty)
   added: (holding b75) (clear b54)
   goals met: 5 of 9
74. (putdown b75)
   deleted: (holding b75)
   added: (clear b75) (arm-empty) (on-table b75)
   goals met: 5 of 9
75. (unstack b54 b64)
   deleted: (on b54 b64) (clear b54) (arm-empty)
   added: (holding b54) (clear b64)
   goals met: 5 of 9
76. (putdown b54)
   deleted: (holding b54)
   added: (clear b54) (arm-empty) (on-table b54)
   goals met: 5 of 9
77. (unstack b64 b38)
   deleted: (on b64 b38) (clear b64) (arm-empty)
   added: (holding b64) (clear b38)
   goals met: 5 of 9
78. (putdown b64)
   deleted: (holding b64)
   added: (clear b64) (arm-empty) (on-table b64)
   goals met: 5 of 9
79. (unstack b38 b52)
   deleted: (on b38 b52) (clear b38) (arm-empty)
   added: (holding b38) (clear b52)
   goals met: 5 of 9
80. (putdown b38)
   deleted: (holding b38)
   added: (clear b38) (arm-empty) (on-table b38)
   goals met: 5 of 9
81. (unstack b52 b15)
   deleted: (on b52 b15) (clear b52) (arm-empty)
   added: (holding b52) (clear b15)
   goals met: 5 of 9
82. (putdown b52)
   deleted: (holding b52)
   added: (clear b52) (arm-empty) (on-table b52)
   goals met: 5 of 9
83. (unstack b15 b17)
   deleted: (on b15 b17) (clear b15) (arm-empty)
   added: (holding b15) (clear b17)
   goals met: 5 of 9
84. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 5 of 9
85. (unstack b17 b4)
   deleted: (on b17 b4) (clear b17) (arm-empty)
   added: (holding b17) (clear b4)
   goals met: 5 of 9
86. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 5 of 9
87. (unstack b56 b31)
   deleted: (on b56 b31) (clear b56) (arm-empty)
   added: (holding b56) (clear b31)
   goals met: 5 of 9
88. (putdown b56)
   deleted: (holding b56)
   added: (clear b56) (arm-empty) (on-table b56)
   goals met: 5 of 9
89. (unstack b31 b37)
   deleted: (on b31 b37) (clear b31) (arm-empty)
   added: (holding b31) (clear b37)
   goals met: 5 of 9
90. (putdown b31)
   deleted: (holding b31)
   added: (clear b31) (arm-empty) (on-table b31)
   goals met: 5 of 9
91. (unstack b37 b53)
   deleted: (on b37 b53) (clear b37) (arm-empty)
   added: (holding b37) (clear b53)
   goals met: 5 of 9
92. (putdown b37)
   deleted: (holding b37)
   added: (clear b37) (arm-empty) (on-table b37)
   goals met: 5 of 9
93. (unstack b53 b82)
   deleted: (on b53 b82) (clear b53) (arm-empty)
   added: (holding b53) (clear b82)
   goals met: 5 of 9
94. (putdown b53)
   deleted: (holding b53)
   added: (clear b53) (arm-empty) (on-table b53)
   goals met: 5 of 9
95. (unstack b82 b78)
   deleted: (on b82 b78) (clear b82) (arm-empty)
   added: (holding b82) (clear b78)
   goals met: 5 of 9
96. (putdown b82)
   deleted: (holding b82)
   added: (clear b82) (arm-empty) (on-table b82)
   goals met: 5 of 9
97. (unstack b78 b9)
   deleted: (on b78 b9) (clear b78) (arm-empty)
   added: (holding b78) (clear b9)
   goals met: 5 of 9
98. (putdown b78)
   deleted: (holding b78)
   added: (clear b78) (arm-empty) (on-table b78)
   goals met: 5 of 9
99. (unstack b9 b21)
   deleted: (on b9 b21) (clear b9) (arm-empty)
   added: (holding b9) (clear b21)
   goals met: 5 of 9
100. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 5 of 9
101. (unstack b21 b59)
   deleted: (on b21 b59) (clear b21) (arm-empty)
   added: (holding b21) (clear b59)
   goals met: 5 of 9
102. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 5 of 9
103. (unstack b59 b12)
   deleted: (on b59 b12) (clear b59) (arm-empty)
   added: (holding b59) (clear b12)
   goals met: 5 of 9
104. (putdown b59)
   deleted: (holding b59)
   added: (clear b59) (arm-empty) (on-table b59)
   goals met: 5 of 9
105. (unstack b12 b65)
   deleted: (on b12 b65) (clear b12) (arm-empty)
   added: (holding b12) (clear b65)
   goals met: 5 of 9
106. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 5 of 9
107. (unstack b65 b6)
   deleted: (on b65 b6) (clear b65) (arm-empty)
   added: (holding b65) (clear b6)
   goals met: 5 of 9
108. (putdown b65)
   deleted: (holding b65)
   added: (clear b65) (arm-empty) (on-table b65)
   goals met: 5 of 9
109. (unstack b4 b71)
   deleted: (on b4 b71) (clear b4) (arm-empty)
   added: (holding b4) (clear b71)
   goals met: 5 of 9
110. (stack b4 b6)
   deleted: (clear b6) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b6)
   goals met: 6 of 9
111. (unstack b71 b3)
   deleted: (on b71 b3) (clear b71) (arm-empty)
   added: (holding b71) (clear b3)
   goals met: 6 of 9
112. (putdown b71)
   deleted: (holding b71)
   added: (clear b71) (arm-empty) (on-table b71)
   goals met: 6 of 9
113. (unstack b3 b27)
   deleted: (on b3 b27) (clear b3) (arm-empty)
   added: (holding b3) (clear b27)
   goals met: 6 of 9
114. (stack b3 b4)
   deleted: (clear b4) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b4)
   goals met: 7 of 9
115. (unstack b5 b44)
   deleted: (on b5 b44) (clear b5) (arm-empty)
   added: (holding b5) (clear b44)
   goals met: 7 of 9
116. (stack b5 b3)
   deleted: (clear b3) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b3)
   goals met: 8 of 9
117. (unstack b2 b1)
   deleted: (on b2 b1) (clear b2) (arm-empty)
   added: (holding b2) (clear b1)
   goals met: 6 of 9
118. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 7 of 9
119. (unstack b1 b7)
   deleted: (on b1 b7) (clear b1) (arm-empty)
   added: (holding b1) (clear b7)
   goals met: 6 of 9
120. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 6 of 9
121. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 5 of 9
122. (stack b2 b1)
   deleted: (clear b1) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b1)
   goals met: 7 of 9
123. (unstack b7 b8)
   deleted: (on b7 b8) (clear b7) (arm-empty)
   added: (holding b7) (clear b8)
   goals met: 6 of 9
124. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 6 of 9
125. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 6 of 9
126. (stack b8 b5)
   deleted: (clear b5) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b5)
   goals met: 7 of 9
127. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 7 of 9
128. (stack b7 b8)
   deleted: (clear b8) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b8)
   goals met: 8 of 9
129. (unstack b2 b1)
   deleted: (on b2 b1) (clear b2) (arm-empty)
   added: (holding b2) (clear b1)
   goals met: 6 of 9
130. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 7 of 9
131. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 7 of 9
132. (stack b1 b7)
   deleted: (clear b7) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b7)
   goals met: 8 of 9
133. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 7 of 9
134. (stack b2 b1)
   deleted: (clear b1) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b1)
   goals met: 9 of 9
